Revit 2027 API
Viewport.Create Method
 Creates a new Viewport at a given location on a sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Viewport Create(
	Document document,
	ElementId viewSheetId,
	ElementId viewId,
	XYZ point
)
Public Shared Function Create (
	document As Document,
	viewSheetId As ElementId,
	viewId As ElementId,
	point As XYZ
) As Viewport
public:
static Viewport^ Create(
	Document^ document,
	ElementId^ viewSheetId,
	ElementId^ viewId,
	XYZ^ point
)
static member Create :
        document : Document *
        viewSheetId : ElementId *
        viewId : ElementId *
        point : XYZ -> Viewport
Parameters
document Document
 The document to which the new Viewport will be added.
viewSheetId ElementId
 The ViewSheet on which the new Viewport will be placed.
viewId ElementId
 The view shown in the Viewport.
point XYZ
 The new Viewport will be centered on this point.
Return Value
Viewport
 The new Viewport.
Exceptions
Exception | Condition
ArgumentException |  viewSheetId is not a ViewSheet. -or- viewId cannot be added to the ViewSheet. -or- Plan view creation is not allowed in this family.
ArgumentNullException |  A non-optional argument was null
ForbiddenForDynamicUpdateException |  This method may not be called during dynamic update.
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 Use [!:Autodesk::Revit::DB::ScheduleSheetInstance::Create()] to add schedules to sheets.
See Also
Reference
Viewport Class
Autodesk.Revit.DB Namespace